// Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1


Console.Write("Введите число 2 ");
string strNumber2 = Console.ReadLine();

int numA = Convert.ToInt32(strNumber1);
int numB = Convert.ToInt32(strNumber2);